# Toposolid Remove Excavation By Method

Source: https://www.revitapidocs.com/2026/2366a1f0-2898-e99a-c1f1-2f0e4454477f.htm

---

| Toposolid Remove Excavation By Method |
| --- |

Removes the excavation between the given element and the Toposolid.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void RemoveExcavationBy(
	ElementId elementId
)
```

```
Public Sub RemoveExcavationBy (
	elementId As ElementId
)
```

```
public:
void RemoveExcavationBy(
	ElementId^ elementId
)
```

```
member RemoveExcavationBy :
        elementId : ElementId -> unit
```

#### Parameters

elementId ElementId
:   Id of the element that already excavates the Toposolid.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The element is not supported for Toposolid excavation operations. |

See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace